In [ ]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.7 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [ ]:
%load_ext sql

New data base ABC_DATA Week 1 day 1 and 2

In [ ]:
%sql sqlite:///ABC_DATA.db

Create 4 tables , Customers, Products, Orders and Order_items using CREATE TABLE command.

In [ ]:
%%sql CREATE TABLE Customers(
    customer_id VARCHAR(25), first_name VARCHAR(25), last_name VARCHAR(25), email VARCHAR(25)
    );

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
(sqlite3.OperationalError) table Customers already exists
[SQL: CREATE TABLE Customers(
    customer_id VARCHAR(25), first_name VARCHAR(25), last_name VARCHAR(25), email VARCHAR(25)
    );]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [ ]:
%%sql CREATE TABLE Products(
    product_id INT(10), product_name VARCHAR(25), price DECIMAL(10,2)
);

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[]

In [65]:
%%sql CREATE TABLE Orders(
    order_id INT(10), cutomer_id INT(10), order_date "YYYY-MM-DD"
);

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
(sqlite3.OperationalError) table Orders already exists
[SQL: CREATE TABLE Orders(
    order_id INT(10), cutomer_id INT(10), order_date "YYYY-MM-DD"
);]
(Background on this error at: https://sqlalche.me/e/20/e3q8)

In [67]:
%sql DROP TABLE Orders;

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[]

In [68]:
%%sql CREATE TABLE Orders(
    order_id INT(10), customer_id INT(10), order_date 'YYYY,MM,DD'
);

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[]

In [ ]:
%%sql CREATE TABLE Order_items(
 oder_id INT(10), product_id INT(10) PRIMARY KEY, qualtity INT(10)
);

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[]

In [72]:
%%sql DROP TABLE Order_items;

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[]

In [75]:
%%sql CREATE TABLE Order_items(
   order_id INT(10), product_id INT(10), quantity INT(10)
);

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[]

Populate VALUES into each table using INSERT INTO command

In [ ]:
%%sql INSERT INTO Customers(customer_id, first_name, last_name, email) VALUES
    (1, 'John', 'Doe', 'johndoe@email.com'),
    (2,'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva','Fisher', 'evafisher@email.com'),
    (7, 'George','Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Johnes', 'ivyjones@email.com'),
    (9, 'kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lilly', 'Nelson', 'lillynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
13 rows affected.

[]

In [ ]:
%sql PRAGMA table_info ('Customers');

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[(0, 'customer_id', 'VARCHAR(25)', 0, None, 0),
 (1, 'first_name', 'VARCHAR(25)', 0, None, 0),
 (2, 'last_name', 'VARCHAR(25)', 0, None, 0),
 (3, 'email', 'VARCHAR(25)', 0, None, 0)]

In [62]:
%%sql INSERT INTO Products(product_id, product_name, price) VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
13 rows affected.

[]

In [66]:
%%sql INSERT INTO orders (order_id, cutomer_id, order_date) VALUES
  (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
16 rows affected.

[]

In [70]:
%%sql INSERT INTO Orders (order_id, customer_id, order_date) VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
16 rows affected.

[]

In [76]:
%%sql INSERT INTO order_items (order_id, product_id, quantity) VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
32 rows affected.

[]

In [77]:
%sql PRAGMA table_info ('Order_items');

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[(0, 'order_id', 'INT(10)', 0, None, 0),
 (1, 'product_id', 'INT(10)', 0, None, 0),
 (2, 'quantity', 'INT(10)', 0, None, 0)]

Week 2 Challenge

1. Which product has the highest price? Only return a single row.

In [79]:
%sql SELECT MAX (price) FROM Products;

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[(70,)]

2.Which order_id had the highest number of items in terms of quantity

In [80]:
%sql SELECT MAX(quantity) FROM Order_items;

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[(4,)]

2b.Which order_id had the highest number of items in terms of quantity

In [81]:
%sql SELECT MAX(order_id) FROM Orders;

   sqlite:///ABC_DARA
   sqlite:///ABC_DARA2ab.ipnyb
   sqlite:///ABC_DATA
 * sqlite:///ABC_DATA.db
   sqlite:///ABC_DATA2ab.ipnyb
Done.

[(16,)]